package com.example.wind.minstory.content;

import com.example.wind.minstory.R;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by wind on 2016/6/29.
 */
public class ContentData {
    public List<Integer> img = new ArrayList<>();
    public List<String> title = new ArrayList<>();
    public List<String> content = new ArrayList<>();
    String content1 = "有一天，兔子碰见乌龟，看见乌龟爬得这么慢，就想戏弄戏弄他，于是笑眯眯地说：“乌龟，乌龟，咱们来赛跑，好吗？”乌龟知道兔子在开他玩笑，瞪着一双小眼睛，不理也不踩。兔子知道乌龟不敢跟他赛跑，乐得摆着耳朵直蹦跳，还编了一支山歌笑话他：\n" +
            "乌龟，乌龟，爬爬爬，一早出门采花；乌龟，乌龟，走走走，傍晚还在门口。乌龟生气了，说：“兔子，兔子，你别神灵活现的，咱们就来赛跑!”龟兔赛跑龟兔赛跑 (7张)“什么？乌龟，你说什么？”“咱们这就来赛跑。”\n" +
            "兔子一听，差点笑破了肚子：“乌龟，你真敢跟我赛跑？那好，咱们从这儿跑起，看谁先跑到那边山脚下的一棵大树。预备！一，二，三，－－－”兔子撒开腿就跑，跑得真快，一会儿就跑得很远了。他回头一看，乌龟才爬了一小段路呢，心想：乌龟敢跟兔子赛跑，真是天大的笑话！我呀，在这儿睡上一大觉，让他爬到这儿，不，让他爬到前面去吧，我三蹦二跳的就追上他了。\n" +
            "“啦啦啦，胜利准是我的嘛！”兔子把身子往地上一躺，合上眼皮，真的睡着了。再说乌龟，爬得也真慢，可是他一个劲儿地爬，爬呀，爬呀，爬，等他爬到兔子身边，已经筋疲力尽了。兔子还在睡觉，乌龟也想休息一会儿，可他知道兔子跑得比他快，只有坚持爬下去才有可能赢。于是，他不停地往前爬、爬、爬。离大树越来越近了，只差几十步了，十几步了，几步了………终于到了。\n" +
            "兔子呢？他还在睡觉呢！兔子醒来后往后一看，唉，乌龟怎么不见了？再往前一看，哎呀，不得了了！乌龟已经爬到大树底下了。兔子一看可急了，急忙赶上去可已经晚了，乌龟已经赢了。\n" +
            "兔子跑得快，乌龟跑得慢，为什么这次比赛乌龟反而赢了呢？";
    String content2 = "战国时期有一个楚国人做事很刻板，书上怎么写的他就怎么做，甚至遇到事情别人怎么做的，他也学着怎么做，从没想过变通一下。[2] \n" +
            "有一次，他经过山林，看见一樵夫在砍柴。忽然，樵夫一不小心.斧头从手上飞脱，掉进山谷里去了。樵夫不慌不忙地在斧头落下的地方做了一个显眼的记号，然后从旁边的小路绕下山去，对照着山上L的标记，很快在草丛里找到了斧头。这位楚国人对樵夫仰慕不已。\n" +
            "这位楚国人喜爱剑术，总是随身佩带一把宝剑。一天，他搭乘一条渡船过江。他立在船舷边，江两岸景色令人目不暇接。船行至江中，陶醉于美景的他不小心，让那把宝剑滑落到江里去了。[2] \n" +
            "只见他紧盯着剑掉下去的地方发呆。旁人劝他赶紧跳下江去打捞，这位楚国人却笑着摇摇头.他眼前浮现出樵夫刻记号的一幕。接着便镇定地说:“别慌张!我自有妙法。”\n" +
            "只见他用一把小刀在船舷上剑掉下去的地方刻了一道深深的记号，并且自言自语道:“我的剑就是从这儿掉下去的!”船继续前行，待船家停船时，这位楚人站起身，面对惊讶的目光，从容不迫地脱了衣服，从船舷边所刻记号处跳人水中。他在水中捞来捞去，怎么也捞不到那把剑，于是浮出水面抚摸着船边的记号，如梦游般喃喃着:“我的剑明明是从这儿掉下去的，怎么找不到了呢";
    String content3 = "从前有个可爱的小姑娘，谁见了都喜欢，但最喜欢她的是她的外婆，简直是她要什么就给她什么。一次，外婆送给小姑娘一顶用丝绒做的小红帽，戴在她的头上正好合适。从此，姑娘再也不愿意戴任何别的帽子，于是大家便叫她“小红帽”。\n" +
            "一天，妈妈对小红帽说：“来，小红帽，这里有一块蛋糕和一瓶葡萄酒，快给外婆送去，外婆生病了，身子很虚弱，吃了这些就会好一些的。趁着现在天还没有黑，赶紧动身吧。在路上要好好走，不要跑，也不要离开大路，否则你会摔跤的，那样外婆就什么也吃不上了。到外婆家的时候，别忘了说‘早上好’，也不要一进屋就东瞧西瞅。”\n" +
            "“我会小心的。”小红帽对妈妈说，并且还和妈妈拉手作保证。\n" +
            "外婆住在村子外面的森林里，离小红帽家有很长一段路。小红帽刚走进森林就碰到了一条狼。小红帽不知道狼是坏家伙，所以一点也不怕它。\n" +
            "“你好，小红帽，”狼说。\n" +
            "“你好，狼先生。”\n" +
            "“小红帽，这么早要到哪里去呀？”\n" +
            "“我要到外婆家去。”\n" +
            "“你那围裙下面有什么呀？”\n" +
            "“蛋糕和葡萄酒。昨天我们家烤了一些蛋糕，可怜的外婆生了病，要吃一些好东西才能恢复过来。”\n" +
            "“你外婆住在哪里呀，小红帽？”\n" +
            "“进了林子还有一段路呢。她的房子就在三棵大橡树下，低处围着核桃树篱笆。你一定知道的。”小红帽说。\n" +
            "狼在心中盘算着：“这小东西细皮嫩肉的，味道肯定比那老太婆要好。我要讲究一下策略，让她俩都逃不出我的手心。”于是它陪着小红帽走了一会儿，然后说：“小红帽，你看周围这些花多么美丽啊！干吗不回头看一看呢？还有这些小鸟，它们唱得多么动听啊！你大概根本没有听到吧？林子里的一切多么美好啊，而你却只管往前走，就像是去上学一样。”\n" +
            "小红帽抬起头来，看到阳光在树木间来回跳荡，美丽的鲜花在四周开放，便想：“也许我该摘一把鲜花给外婆，让她高兴高兴。现在天色还早，我不会去迟的。”她于是离开大路，走进林子去采花。她每采下一朵花，总觉得前面还有更美丽的花朵，便又向前走去，结果一直走到了林子深处。\n" +
            "就在此时，狼却直接跑到外婆家，敲了敲门。\n" +
            "“是谁呀？”\n" +
            "“是小红帽。”狼回答，“我给你送蛋糕和葡萄酒来了。快开门哪。”\n" +
            "“你拉一下门栓就行了，”外婆大声说，“我身上没有力气，起不来。”\n" +
            "狼刚拉起门栓，那门就开了。狼二话没说就冲到外婆的床前，把外婆吞进了肚子。然后她穿上外婆的衣服，戴上她的帽子，躺在床上，还拉上了帘子。";
    private String content4 = "康肃公陈尧咨善于射箭，世上没有第二个人能跟他相媲美，他也就凭着这种本领而自夸。曾经（有一次），（他）在家里（射箭的）场地射箭，有个卖油的老翁放下担子，站在那里斜着" +
            "眼睛看着他，很久都没有离开。卖油的老头看他射十箭中了八九成，但只是微微点点头。\n" +
            "陈尧咨问卖油翁：”你也懂得射箭吗？我的箭法不是很高明吗？”卖油的老翁说：”没有别的（奥妙），不过是手法熟练罢了。”陈尧咨（听后）气愤地说：”你怎么敢轻视我射箭（的本领）！”老翁说：”凭我" +
            "倒油的经验就可以懂得这个道理。”于是拿出一个葫芦放在地上，把一枚铜钱盖在葫芦口上，慢慢地用油杓舀油注入葫芦里，油从钱孔注入而钱却没有湿。于是说：”我也没有别的（奥妙），只不过是手熟练罢了。”陈尧咨笑着将他送走了。";
    private String content5 = "小马过河小马和他的妈妈住在绿草茵茵的十分美丽的小河边。除了妈妈过河给河对岸的村子送粮\n" +
            "食的时候，他总是跟随在妈妈的身边寸步不离。\n" +
            "他过的很快乐，时光飞快地过去了。\n" +
            "有一天，妈妈把小马叫到身边说：“小马，你已经长大了，可以帮妈妈做事了。今天你\n" +
            "把这袋粮食送到河对岸的村子里去吧。”\n" +
            "小马非常高兴地答应了。他驮着粮食飞快地来到了小河边。可是河上没有桥，只能自己\n" +
            "淌过去。可又不知道河水有多深呢？犹豫中的小马一抬头，看见了正在不远处吃草的牛伯\n" +
            "伯。小马赶紧跑过去问到：“牛伯伯，您知道那河里的水深不深呀？”\n" +
            "牛伯伯挺起他那高大的身体笑着说：“不深，不深。才到我的小腿。”小马高兴地跑回\n" +
            "河边准备淌过河去。他刚一迈腿，忽然听见一个声音说：“小马，小马别下去，这河可深\n" +
            "啦。”小马低头一看，原来是小松鼠。小松鼠翘着她的漂亮的尾巴，睁者圆圆的眼睛，很认真地说：“前两天我的一个伙伴不小心掉进了河里，河水就把他卷走了。”小马一听没主意了。\n" +
            "马妈妈老远地就看见小马低着头驮着粮食又回来了。心想他一定是遇到困难了，就迎过\n" +
            "去问小马。小马哭着把牛伯伯和小松鼠的话告诉了妈妈。妈妈安慰小马说：“没关系，咱们\n" +
            "一起去看看吧。”\n" +
            "小马和妈妈又一次来到河边，妈妈这回让小马自己去试探一下河水有多深。小马小心地\n" +
            "试探着，一步一步地淌过了河。噢，他明白了，河水既没有牛伯伯说的那么浅，也没有小松\n" +
            "鼠说的那么深。只有自己亲自试过才知道。";
    private String content6 = "周瑜提出让诸葛亮在十日之内赶制十万支箭的要求，诸葛亮却出人意外地说：" +
            "“曹操大军即日将至，若候十日，必误大事。”他表示：“只须三天的时间，就可以办完复命。”周瑜一听大喜，" +
            "当即与诸葛亮立下了军令状。在周瑜看来，诸葛亮无论如何也不可能在三天之内造出十万枝箭，因此，诸葛亮必死无疑。\n" +
            "诸葛亮告辞以后，周瑜就让鲁肃到诸葛亮处查看动静，打探虚实。诸葛亮一见鲁肃就说：“三日之内如何能造出十万枝箭?还望子" +
            "敬救我!”忠厚善良的鲁肃回答说：“你自取其祸，叫我如何救你?”诸葛亮说：“只望你借给我二十只船，每船配置三十名军士，船只全用青布为" +
            "幔，各束草把千余个，分别竖在船的两舷。这一切，我自有妙用，到第三日包管会有十万支箭。但有一条，你千万不能让周瑜知道。如果他知道了，必定从中" +
            "作梗，我的计划就很难实现了。”鲁肃虽然答应了诸葛亮的请求，但并不明白诸葛亮的意思。他见到周瑜后，不谈借船之事，只说诸葛亮并不准备造箭用的竹、翎毛、胶漆等物品。周瑜听罢也大惑不解。\n" +
            "诸葛亮向鲁肃借得船只、兵卒以后，按计划准备停当。第一天，不见诸葛亮有什么动静！第二天，仍然不见诸葛亮有什么动静！直到第三天夜里四更时分，他才秘密地将鲁" +
            "肃请到船上，并告诉鲁肃要去取箭。鲁肃不解地问：“到何处去取?”诸葛亮回答道：“子敬不用问，前去便知。”鲁肃被弄得莫名其妙，只得陪伴着诸葛亮去看个究竟。";

    public ContentData(){

        title.add("龟兔赛跑");
        img.add(R.mipmap.content_1);
        content.add(content1);

        title.add("刻舟求剑");
        img.add(R.mipmap.kezhou);
        content.add(content2);

        title.add("小红帽");
        img.add(R.mipmap.xiaohongmao);
        content.add(content3);

        title.add("买油翁");
        img.add(R.mipmap.content_4);
        content.add(content4);

        title.add("小马过河");
        img.add(R.mipmap.xiaoma);
        content.add(content5);

        title.add("草船借箭");
        img.add(R.mipmap.content_6);
        content.add(content6);



    }


}
