package com.example.wind.minstory.content;

import com.example.wind.minstory.R;

/**
 * Created by wind on 2016/4/20.
 */
public class MainContentData {

    //标题
    private String[] titles = {"龟兔赛跑", "刻舟求剑", "小红帽",
            "卖油翁","小马过河","草船借箭","程门立雪","卧薪尝胆","三个和尚"};

    public int[] getImgs() {
        return imgs;
    }

    public void setImgs(int[] imgs) {
        this.imgs = imgs;
    }

    public String[] getIntros() {
        return intros;
    }

    public void setIntros(String[] intros) {
        this.intros = intros;
    }

    public String[] getTitles() {
        return titles;
    }

    public void setTitles(String[] titles) {
        this.titles = titles;
    }

    //图片
    private int[] imgs = {R.mipmap.ic_guitusaipao, R.mipmap.kezhou, R.mipmap.xiaohongmao
            ,R.mipmap.maiyouwen,R.mipmap.xiaoma1,R.mipmap.conntent,R.mipmap.conntent1
            ,R.mipmap.conntent2,R.mipmap.conntent3};
    //简介
    private String[] intros = {"有一天，兔子和乌龟跑步，兔子嘲笑乌龟爬得慢，乌龟" +
            "说，总有一天他会赢。兔子说，我们现在就开始比赛。兔子飞快的跑着，乌龟拼命",
            "有个楚国人渡江，他的剑从船里掉到水中，急忙在船边上" +
                    "刻了个记号，说：“这儿是我的剑掉下去的地方。”船停了，（这个楚国人）从他刻记号的地方下水寻找剑。",
            "故事讲述了从前有个人见人爱的小姑娘，喜欢戴着外婆送给她的一顶红色天鹅绒的帽子，于是大家就叫她小红帽。有一天，" +
                    "母亲叫她给住在森林的外婆送食物，并嘱咐她不要离开大路，走得太远。小红帽在森林中遇见了她从未见过狼"
            ,"本文是北宋欧阳修所著的一则写事明理的寓言故事，记述了陈尧咨射箭和卖油翁酌油的事，形象地说明了“熟能生巧”、“实" +
            "践出真知”、“人外有人”的道理。寓意是──所有技能都能透过长期反复苦练而达至熟能生巧之境。"
    ,"有一天，老马对小马说：“你已经长大了，能帮妈妈做点事吗？”小马连蹦带跳地说：“怎么不能？我很愿意帮您做事。”老马高兴地说：“那好啊，你把这半口袋麦子驮到磨坊去吧。”\n" +
            "小马驮起口袋，飞快地往磨坊跑去。跑着跑着，一条小河挡住了去路，河水哗哗地流着。小马为难了，心想：我能不能过去呢？如果妈妈在身边，问问她该怎么办，那多好啊！" +
            "可是离家很远了。小马向四周望望，看见一头老牛在河边吃草，小马“嗒嗒嗒”跑过去，问道：“牛伯伯，请您告诉我，这条河，我能趟过去吗？”老牛说：“水很浅，刚没小腿，能趟过去。”"
    ,"周瑜看到诸葛亮挺有才干，心里很妒忌。有一天，周瑜请诸葛亮商议军事，说：“我们就要跟曹军交战。水上交战，用什么兵器最好？”诸葛亮说：“用弓箭最好。”周瑜说：“对，先生跟我想的一样。现在军中缺箭，想请先生负责赶造十万支。"
    ,"　程颢、程颐兄弟俩都是宋代极有学问的人。进士杨时，为了丰富自已的学问，毅然放弃了高官厚禄，跑到河南颍昌拜程颢为师，虚心求教。后来程颢死，他自己也有40多岁，但仍然立志求学，刻苦钻研，又跑到洛阳去拜程颢的弟弟程颐为师。"
            ,"吴王阖闾打败楚国，成了南方霸主。吴国跟附近的越国(都城在今浙江绍兴)素来不和。公元前496年，越国国王勾践即位。吴王趁越国刚刚遭到丧事，就发兵打越国。吴越两国在槜李(今浙江嘉兴西南，槜音zuì)地方，发生一场大战。"
            ,"从前有座山，山上有一个破庙，有一天，一个小和尚他来到庙里,看见庙里的水缸没水了，就挑来水倒满了水缸，还给观音瓶子里加满了水，干枯的杨枝终于恢复了生机。他每天挑水、念经、敲木鱼，夜里不让老鼠来偷东西，生活过得安稳自在。"
    };


}
